Documents/АктСнятияПоказанийХолоднойВоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>АктСнятияПоказанийХолоднойВоды</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АктСнятияПоказанийХолоднойВоды</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПриборов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственныйВладелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Квартира</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеПредыдущее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеТекущее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазницаПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/АктСнятияПоказанийХолоднойВоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>АктСнятияПоказанийХолоднойВоды</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоказаниеПредыдущее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказаниеТекущее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазницаПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ВидыТарифов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дневной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ночной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пиковый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Общий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСредней</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АктСнятияПоказанийХолоднойВоды/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = Справочники.Организации.НайтиПоКоду("000000001");
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЛицевойСчетПриИзмененииНаСервере(АдресЛицевыхСчетовВХранилище = Неопределено,ИндивидуальныйВвод = ложь)
	Объект.Здание = Объект.ЛицевойСчет.Владелец;
	Объект.Организация = Объект.Здание.Владелец;
	
	Объект.ПоказанияПриборов.Очистить();
	
	Запрос = Новый Запрос;
	Если АдресЛицевыхСчетовВХранилище <> Неопределено Тогда
		ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	
		МассивОбъектовУстановки = ТаблицаДляЗагрузки.ВыгрузитьКолонку("ЛицевойСчет");
		
		ТекстЗапросаДоб = "	И УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки В(&МассивОбъектовУстановки)";
		Запрос.УстановитьПараметр("МассивОбъектовУстановки", МассивОбъектовУстановки);
	ИначеЕсли ИндивидуальныйВвод Тогда
		МассивОбъектовУстановки = Новый Массив;
		МассивОбъектовУстановки.Добавить(Объект.ЛицевойСчет);
		
		ТекстЗапросаДоб = "	И УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки В(&МассивОбъектовУстановки)";
		Запрос.УстановитьПараметр("МассивОбъектовУстановки", МассивОбъектовУстановки);
	Иначе
		ТекстЗапросаДоб = "";
	КонецЕсли;	

	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки КАК ЛицевойСчет,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета КАК Квартира,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.ОбъектЛицевогоСчета.Владелец КАК Здание,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Коэффициент КАК Коэффициент,
		|	ЕСТЬNULL(УслугиВидыТарифов.ВидТарифа, ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Общий)) КАК ВидТарифа,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	АктСнятияПоказанийХолоднойВодыСрезПоследних.ПоказаниеТекущее
		|ИЗ
		|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&ДатаСреза, ) КАК УстановленныеПриборыУчетаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Услуги.ВидыТарифов КАК УслугиВидыТарифов
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга = УслугиВидыТарифов.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктСнятияПоказанийХолоднойВоды.СрезПоследних КАК АктСнятияПоказанийХолоднойВодыСрезПоследних
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = АктСнятияПоказанийХолоднойВодыСрезПоследних.ПриборУчета
		|ГДЕ
		|	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА
		|	И УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.Услуга.ВидУслуги = &ВидУслуги" + ТекстЗапросаДоб + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	АктСнятияПоказанийХолоднойВодыСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаСреза", Новый Граница(Объект.ПериодНачисления, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ВидУслуги", Справочники.ВидыУслуг.ХолоднаяВода);	

	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ_Заполнения = Новый ТаблицаЗначений;
	ТЗ_Заполнения.Колонки.Добавить("ЛицевойСчет");
	ТЗ_Заполнения.Колонки.Добавить("ОтветственныйВладелец");
	ТЗ_Заполнения.Колонки.Добавить("Квартира");
	ТЗ_Заполнения.Колонки.Добавить("ПриборУчета");
	ТЗ_Заполнения.Колонки.Добавить("ЕдиницаИзмерения");
	ТЗ_Заполнения.Колонки.Добавить("ВидТарифа");
	ТЗ_Заполнения.Колонки.Добавить("Коэффициент");
	ТЗ_Заполнения.Колонки.Добавить("ПоказаниеПредыдущее");
	ТЗ_Заполнения.Колонки.Добавить("ПоказаниеТекущее");
	ТЗ_Заполнения.Колонки.Добавить("РазницаПоказания");
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрока = ТЗ_Заполнения.Добавить();
		НовСтрока.ЛицевойСчет = Выборка.ЛицевойСчет;
		НовСтрока.ОтветственныйВладелец = Выборка.ОтветственныйВладелец;
		НовСтрока.Квартира = Выборка.Квартира;
		НовСтрока.ПриборУчета = Выборка.ПриборУчета;
		НовСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
		НовСтрока.ВидТарифа = Выборка.ВидТарифа;
		НовСтрока.Коэффициент = Выборка.Коэффициент;
		НовСтрока.ПоказаниеПредыдущее = Выборка.ПоказаниеТекущее;
	КонецЦикла;
	Объект.ПоказанияПриборов.Загрузить(ТЗ_Заполнения);
КонецПроцедуры

&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	ЛицевойСчетПриИзмененииНаСервере(,?(ЗначениеЗаполнено(Объект.ЛицевойСчет),Истина,ЛОЖЬ));
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовПоказаниеТекущееПриИзменении(Элемент)
	ТекДанные = Элементы.ПоказанияПриборов.ТекущиеДанные;
	ТекДанные.РазницаПоказания = ТекДанные.ПоказаниеТекущее - ТекДанные.ПоказаниеПредыдущее;
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовПриборУчетаПриИзменении(Элемент)
	ТекСтрока                     = Элементы.ПоказанияПриборов.ТекущиеДанные;
	ТекСтрока.ЕдиницаИзмерения    = ОбщийМодульМВК.ЕдиницаИзмПриборУчета(ТекСтрока.ПриборУчета);
	ТекСтрока.Коэффициент         = ОбщийМодульМВК.Коэффициент(ТекСтрока.ПриборУчета);
	ТекСтрока.ВидТарифа           = ОбщийМодульМВК.ВидТарифа();
	ДанныеПоСчетчику              = РасчетУслугПоТЕиГВ.ПолучитьПоказанияПрибораУчетаПоХВ(ТекСтрока.ПриборУчета, Объект.ПериодНачисления);
	Если ЗначениеЗаполнено(ДанныеПоСчетчику) Тогда
		ТекСтрока.ПоказаниеПредыдущее = ДанныеПоСчетчику.ПоказаниеПредыдущее;
	КонецЕсли;
КонецПроцедуры
